[{"id":"2012.md","year":2012,"title":"Beginning of everything","content":"<p>I don't clearly remember, but thoses days mig33 was in hype. I was in class 8.\nI was learning HTML, CSS and found JS since a year so, started new project to hold mig33 community and named LuMig33 and rebranded as HitMig33.\nIt was just a static website build with inline css for mig33 app view.</p>\n"},{"id":"2013.md","year":2013,"title":"Found PHP and MySQL Database","content":"<p>Drag n Drop builders like blogspot, Dreamweaver were available but I always wanted full control.\nI was full-time learner and programming in general was what I wanted at that time.\nFinding PHP and It's easy DB connection boosted my interest in web development.\nDynamic web pages and exploration of globals, auth with session was kind of cool for me.</p>\n"},{"id":"2014.md","year":2014,"title":"Break","content":"<p>SLC was around corner and learning continued in background. My schooling completed at <strong>Ex-Servicemen Children Academy</strong>.</p>\n"},{"id":"2015.md","year":2015,"title":"Went Kathmandu to live a dream","content":"<p>Joined <strong>Kasthmandap College</strong> for +2. Worked on custom PHP framework to build social networking site.\nPitched in class, found useful tips and tricks about product and marketing.\nJoined Microsoft Student Partner Program.\nFound CodeIgniter PHP framework and started working as a freelance contractor with few of internet friends as beginner full stack developer.\nGot my own very first client to develop product showcase site.\nUsing Ubuntu with dual-boot and sublime-text.</p>\n"},{"id":"2016.md","year":2016,"title":"Science, Freelance, Teaching, full-time Job and College","content":"<p>Academic study was not fulfilling.\nFound Laravel and loved everything that was not available in CI.\nFound composer and git to be very helpful.\nStill taking projects as freelance developer.\nStarted teaching for few months then joined <strong>Blue Muffin Studio</strong> as full-time full stack web developer.\nFound WordPress and fall in love with it. Easy development with less effort.\nExperienced office life and different software development process.\nI got to work on different projects with different developers.\nJoined <strong>Ambition College</strong> for Bachelor in Computer Science and Information Technology (B.Sc.CSIT) degree.</p>\n"},{"id":"2017.md","year":2017,"title":"College, Job, Freelance and more exploration of tech in general","content":"<p>Tried C, C++ in college. Completed GUI thin client chat application with C++ and Laravel backend server.\nFound Angular, AngularJS and ReactJS. Angular was on hype and backed by google so picked it and completed serval projects using Angular.\nWorked on custom eCommerce project build on Laravel and Angular. Found React Native, Phonegap and Kotlin.\nCompleted few sample projects with React Native, Phonegap and Kotlin.\nFound MongoDB and started using redis as cache server. Started using WHM, CDN, VPS, full page cache and lot others.\nFound knockoutJS and modified existing product. Found Magento 1 &amp; 2.\nExperienced Magento projects on job and freelance.\nUsing Ubuntu and PhpStorm.</p>\n"},{"id":"2018.md","year":2018,"title":"Switched Job and continued exploration","content":"<p>Academic study was never fulfilling.\nFound python and it's fun.\nContinued digging PHP, MySQL, Laravel, WordPress, JavaScript, Angular, React Native.\nAfter 2 years of working, I took small break and joined <strong>Rillmark</strong> as full-time Laravel developer.\nMeet new people and got to work on multi level marketing like product.\nSwitched to <strong>Javra Software</strong> as Software Engineer and started working on heavily customized Magento2 EE (B2B).\nFound flutter and started tweaking.\nHopped into different linux distro.</p>\n"},{"id":"2019.md","year":2019,"title":"Javra Software and Magento2","content":"<p>Experienced Agile/Scrum Methodology, best practices &amp; coding patterns, Magento2 Enterprise Edition architecture, Custom Magento2 Erp Connector flow, Custom Magento2 PIM Connector flow, elasticsearch, varnish &amp; reverse proxy, load balancer, distributed computing, scaling strategies, bash automation, containerized development and super git flow for controlled deployment and development.\nPromoted to Senior Software Engineer.\nExperienced swagger, openAPI specification, graphQL, HTTP versions and caching. Taking symfony5 and react pwa seriously.\nHopped into different linux distro.</p>\n"},{"id":"2020.md","year":2020,"title":"Quarantine and continued exploration","content":"<p>Experienced CI/CD and better way of software development with different development tools.\nFound serverless, notebook, online vscode or editors, remote development flow, WSL2, WSL2 + docker for software development.\nWorking with Magneto2 Venia PWA.\nExploring symfony5 and bundle architecture.\nExploring microservice architecture and event sourcing for distributed system.\nBuild few opensource development docker and github actions with <strong>ReadyMadeHost</strong>.\nHopped into Arch, WSL2 and using vscode + PhpStorm.</p>\n"},{"id":"2021.md","year":2021,"title":"College project and fresh code start","content":"<p>Exploring asynchronous PHP, coroutine and alternative PHP runtime.\nCompleted final year college project as Catalog Stickers with symfony5, magento2 and image processing with edge detection algorith written in python, used RabbitMQ for queue process, used GD library for image manupulation.\nStarted <strong>EveryWorkflow</strong> project with ReactJS, symfony and MongoDB.\nUsing Ant design UI for frontend development, Symfony with lots of custom build bundles for backend development.\nSwitched to <strong>Sastodeal</strong> as Tech Lead.\nKeeping eye on PHP8, rust and flutter.\nHopped into Arch, WSL2 + GWSL and using vscode + Neovim + PhpStorm.</p>\n"},{"id":"2022.md","year":2022,"title":"Sastodeal and EveryWorkflow development","content":"<p>Magento2 EE Marketplace ecommerce development and maintainance.\nExploring PHP, symfony and MongoDB integration.\nExploring multiple frontend development by sharing components.\nExploring turborepo and symfony encore with webpack.\nFound ansible and automated Arch with AwesomeWM complete setup and WSL2 setup with dot files.\nExploration on docker swarm cluster and Kubernetes cluster for software deployment.\nFound rust actix web framework. Found SolidJS and liked it, due to its Fine-grained reactivity and no virtual DOM.\nFound Bun JS runtime. Found Svelte frontend framework which uses compiler to directly generate minimal javascript code to ship.\nKeeping eye on PHP, SolidJS and rust.\nHopped into Arch with DWM or AwesomeWM, Windows, MacOS and using Neovim + vscode.</p>\n"},{"id":"2023.md","year":2023,"title":"Collaboration and continued development","content":"<p>Development of everyworkflow platform.\nSeparated frontend and backend projects for more headless experience.\nTurborepo is used for frontend using which React ViteJS and NextJS apps are integrated together.\nFound rust leptos frontend framework and using it for sample projects.\nKeeping eye on JavaScript and rust.\nHopped into Arch with AwesomeWM or Hyprland, Windows, MacOS and using Neovim...</p>\n"}]